NOT_EXISTS_CONTRACTS = '❗️У вас нет действующих договоров с арендодателем.'

PERSONAL_DATA_NOT_EXISTS = ('📍Вы не заполнили свои данные.📍\n\nВыберите в '
                            'меню "<b>Мои данные</b>" или '
                            'Нажмите /personal_data')

PERSONAL_DATA_WRONG = ('Для редактирования данных выберите в меню '
                       '"<b>Мои данные</b>".\nИли нажмите /personal_data')

PERSONAL_DATA = ('Ваши данные:\n'
                 '📌<b>{last_name} {first_name} {middle_name}</b>\n'
                 '📌<b>Пол:</b> {gender}\n'
                 '📌<b>Дата рождения:</b> {birthday}\n'
                 '📌<b>Почта:</b> {email}\n'
                 '📌<b>Номер телефона:</b> {phone_number}\n'
                 '📌<b>Паспорт:</b> {passport_serial} №{passport_number}\n'
                 '📌<b>Выдан:</b> {passport_date_of_issue} '
                 '{passport_issued_by}\n'
                 '📌<b>Адрес прописки:</b> {address_registration}\n'
                 '📌<b>Адрес проживания:</b> {address_of_residence}\n\n'
                 '📌<b>Близкий человек:</b> {close_person_phone} '
                 '{close_person_name}\n'
                 '📌<b>Адрес:</b> {close_person_address}')

CONTRACT_EXISTS_NO_PHOTO = ('Договор сформирован, но вы еще не скинули '
                            'фотографии машины.')
ASK_CAR_PHOTOS = ('Сфотографируйте и отправьте мне <b>фотографии машины</b>.\n'
                  '\nМожно скинуть по одному или все разом. Я их все сохраню '
                  'для Вас на будущее.\n\n❗️'
                  '<i>Сделайте больше фотографий, после подтверждения их '
                  'нельзя будет изменить!</i>')
